{
    "data1": [
        {
            "text": "It is a slow day at the workplace, not much is going on at the moment. You glance down at your desk, staring at the envelopes that are piled on your desk. Looking around, you notice that your desk is the most cluttered out of all of your colleagues'. Files upon files of identities of suspects and missing people lie there untouched. One case has always stood out to you, a case that involves people that you look to and have admired since you were a kid. Scientists. The fascination of astronomy and spacecrafts never died down, it only grew as the case grew cold. The room becomes eerily quiet, you realize you are the only one left in the room. After a few seconds of silence, the phone on your desk rings. What should you do?",
            "responses": "2",
            "response1Choice": "Answer phone",
            "response1": "You answer the phone. The caller introduces himself as the founder of the space agency. He mentions that he is in a bit of a dilemma. Concerned, you ask about the details of the situation. You find out that a communications blackout has occurred and that he needs you to investigate the area. He says that he has gotten recommendations about you being one of the best detectives in your line of work. You consider the opportunity, but remain skeptical about the task. Should you go to the space station?",
            "response2Choice": "Ignore it",
            "response2": "The call goes to voicemail. You listen to the message that was sent to you. The caller introduces himself as the founder of the space agency. This peaks your interest. You listen as the founder explains his dilemma. A communications blackout has occurred, he wants you to investigate the surrounding area, after all, you are one of the best detectives in your field of work. There is just one thing, you cannot tell anyone about the task. As flattered as you are, you can't help but feel skeptical about the 'secret task'. At the end, he asks you to call him if you are up for the task. Should you call him back?"
        }
    ],
    
    "data2": [
        {
            "text": "An opportunity arises",
            "responses": "3",
            "response1Choice": "Go to the space station",
            "response1": "You choose to go to the space station despite your suspicions. You make your way to the launch site to investigate the communications blackout.",
            "response2Choice": "Don't go to the space station",
            "response2": "You choose to stay home instead of leaving and heading to the launch site, when the morning comes for your scheduled departure.  After several minutes, you hear a car outside, followed by a knock on your door.  Two men in suits are standing at your door, here to take you to the launch site.  They eventually convince you to join them, and you continue with the launch.",
            "response3Choice": "Don't call the agency",
            "response3": "Story ends and nothing special happens.  Boring ending"
        }
    ],
    "data3": [
        {
            "text": "Now aboard the station, you find yourself in a pitch black area.  You were given a flashlight and night vision built into your space suit helmet, but they both use a percentage of your suit battery.",
            "responses": "2",
            "response1Choice": "Use flashlight",
            "response1": "You decide to turn on your helmet flashlight, allowing you to see a moderately sized circle of light in front of you.  You can't see as much as with night vision, but your battery usage is less. Should you keep exploring this room or search for the next room?",
            "response2Choice": "Use night vision",
            "response2": "You decide to activate nightvision, allowing you to see your surroundings. The only problem is that night vision uses more battery than the flashlight. You look around the station, trying to find the cause of the blackout. Should you keep exploring this room or search for the next room?"
        }
    ],
    "data4": [
        {
            "text": "Explore more or search for next room?",
            "responses": "2",
            "response1Choice": "Explore",
            "response1": "You choose to further explore the room.",
            "response2Choice": "Next room",
            "response2": "You choose to move on to the next room."
        }
    ],
    "data5": [
        {
            "responses": "2",
            "response1": "You look around for a long while, taking in as much as you can with the relatively small area you can see bathed in light.  You eventually find a filing cabinet.  It looks to be in good condition, relative to the floating debris and poor condition of everything else around you.  The top drawer is smashed in and unopenable, but the bottom two drawers appear to be working fine.",
            "response2": "You look around for a little while, keeping mental notes of things you deem to be somewhat important.  You eventually find a filing cabinet.  It looks to be in good condition, relative to the floating debris and poor condition of everything else around you.  The top drawer is smashed in and unopenable, but the bottom two drawers appear to be working fine."
        }
    ],
    "data6": [
        {
            "text": "Open the drawers?",
            "responses": "2",
            "response1Choice": "Yes",
            "response1": "You attempt to open each of the two bottom drawers.  The middle drawer is locked and won't open.  The bottom drawer opens easily, and contains a single piece of paper.  It appears to be a note, and in rather good condition.",
            "response2Choice": "No",
            "response2": "You dismiss the file cabinet as another piece of broken furniture and debris, to be forgotten and left behind."
        }
    ],
    "data7": [
        {
            "text": "Read the note?",
            "responses": "2",
            "response1Choice": "Yes",
            "response1": "You pick up the note and read it. The note is written by a former scientist named 'Theo' who worked aboard the station. The note is a journal entry of his first days aboard the station, and has an air of excitement in the way it's written.",
            "response2Choice": "No",
            "response2": "You ignore the note and close the filing cabinet.  There's no time for reading silly little notes when there's a much bigger job to be done."
        }
    ],
    "data8": [
        {
            "text": "Continue exploring or move to next room?",
            "responses": "2",
            "response1Choice": "Continue exploring",
            "response1": "You find nothing worthy of note in this area.",
            "response2Choice": "Next room",
            "response2": "You choose to move on to the next room."
        }
    ],
    "data9": [
        {
            "text": "You decide to make your way toward the next room. As you get closer, you start to hear something. You hear shuffling in the distance.",
            "responses": "2",
            "response1Choice": "",
            "response1": "",
            "response2Choice": "",
            "response2": ""
        }
    ]
}